# В этом файле хранятся сценарии из статьи «Лексическая структура программы Python»
# Чтобы лучше понять смысл этих сценариев, используйте обычную командную строку для их ввода.

# 1 сценарий
print('Hello, World!')

# 2 сценарий
x = [1, 2, 3]
print(x[1:2])

# 3 сценарий
'foobar'[2:5]

# 4 сценарий
person1_age = 42
person2_age = 16
person3_age = 71
someone_is_of_working_age = (person1_age >= 18 and person1_age <= 65) or (person2_age >= 18 and person2_age <= 65) or (person3_age >= 18 and person3_age <= 65)
someone_is_of_working_age

# 5 сценарий
a = [[1, 2, 3, 4, 5], [6, 7, 8, 9, 10], [11, 12, 13, 14, 15], [16, 17, 18, 19, 20], [21, 22, 23, 24, 25]]
a

# 6 сценарий
a = [
[1, 2, 3, 4, 5],
[6, 7, 8, 9, 10],
[11, 12, 13, 14, 15],
[16, 17, 18, 19, 20],
[21, 22, 23, 24, 25]
]
a

# 7 сценарий
someone_is_of_working_age = (
(person1_age >= 18 and person1_age <= 65)
or (person2_age >= 18 and person2_age <= 65)
or (person3_age >= 18 and person3_age <= 65)
)
someone_is_of_working_age

# 8 сценарий
x = (
1 + 2
+ 3 + 4
+ 5 + 6
)
x

# 9 сценарий
print(
'foo',
'bar',
'baz'
)

# 10 сценарий
'abc'.center(
9,
'-'
)

# 11 сценарий
t = (
'a', 'b',
'c', 'd'
)
t

# 12 сценарий
d = {
'a': 1,
'b': 2
}
d

# 13 сценарий
x1 = {
'foo',
'bar',
'baz'
}
x1

# 14 сценарий
a = [
'foo', 'bar',
'baz', 'qux'
]
a

# 15 сценарий
a[
1
]

# 16 сценарий
a[
1:2
]

# 17 сценарий
d[
'b'
]

# 18 сценарий
a = [
[
['foo', 'bar'],
[1, 2, 3]
],
{1, 3, 5},
{
'a': 1,
'b': 2
}
]
a

# 19 сценарий
s = \
'Hello, World!'
s

# 20 сценарий
x = 1 + 2 \
+ 3 + 4 \
+ 5 + 6
x

# 21 сценарий
x = 1; y = 2; z = 3
print(x); print(y); print(z)

# 22 сценарий
x, y, z = 1, 2, 3
print(x, y, z, sep='\n')

# 23 сценарий
a = ['foo', 'bar', 'baz']  # Я комментарий.
a
# 24 сценарий
# Я комментарий.
     # Я тоже. 

# 25 сценарий
a = 'foobar # Я *не* комментарий.'
a

# 26 сценарий
# Вычислить и отобразить площадь круга.
pi = 3.1415926536
r = 12.35
area = pi * (r ** 2)
print('Площадь круга с радиусом', r, 'равна', area)

# 27 сценарий
x = (1 + 2           # Я комментарий.
+ 3 + 4         # Я тоже.
+ 5 + 6)
x

# 28 сценарий
a = [
'foo', 'bar',    # И я тоже.
'baz', 'qux'
]
a

# 29 сценарий
/*
[Это не Python!]
Инициализируйте значение радиуса круга.
Затем вычислите площадь круга
и выведите результат на консоль.
*/

# 30 сценарий
# Инициализируйте значение радиуса круга.
#
# Затем вычислите площадь круга
# и выведите результат на консоль.
pi = 3.1415926536
r = 12.35
area = pi * (r ** 2)
print('Площадь круга с радиусом', r, 'равна', area)

# 31 сценарий
"""Инициализируйте значение радиуса круга.
Затем вычислите площадь круга
и выведите результат на консоль.
"""
pi = 3.1415926536
r = 12.35
area = pi * (r ** 2)
print('Площадь круга с радиусом', r, 'равна', area)

# 32 сценарий
x=3; y=12
x+y

# 33 сценарий
(x==3)and(x<y)

# 34 сценарий
a=['foo','bar','baz']
a

# 35 сценарий
d={'foo':3,'bar':4}
d

# 36 сценарий
x,y,z='foo',14,21.1
(x,y,z)

# 37 сценарий
z='foo'"bar"'baz'#Комментарий
z

# 38 сценарий
value1=100
value2=200
v=(value1>=0)and(value1<value2)
v

# 39 сценарий
value1 = 100
value2 = 200
v = (value1 >= 0) and (value1 < value2)
v

# 40 сценарий
s = "foo"'bar''''baz'''
s

# 41 сценарий
s = 'foo' "bar" '''baz'''
s

# 42 сценарий
s = 'bar'
s in ['foo', 'bar', 'baz']

# 43 сценарий
y is 20

# 44 сценарий
'qux' not in ['foo', 'bar', 'baz']
